corrected_updatecard_soap_request_v3.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
  <soap:Body>
    <tem:UpdateCard>
      <tem:userId>12345</tem:userId>
      <tem:profileName>John Doe</tem:profileName>
      <tem:cardNumber>1001</tem:cardNumber>
      <tem:systemNumber>1</tem:systemNumber>
      <tem:versionNumber>1</tem:versionNumber>
      <tem:miscNumber>0</tem:miscNumber>
      <tem:cardStatus>Active</tem:cardStatus>
      <tem:cardName>John Doe - Active Card</tem:cardName>
    </tem:UpdateCard>
  </soap:Body>
</soap:Envelope>
